In [2]:
import pandas as pd
import sklearn

# Load a tabular data set

In [3]:
df = pd.read_csv('people-example.csv')

In [4]:
df #we can view first few lines of table

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [5]:
# .show() visualizes any data structure in GraphLab Create
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
First Name    7 non-null object
Last Name     7 non-null object
Country       7 non-null object
age           7 non-null int64
dtypes: int64(1), object(3)
memory usage: 304.0+ bytes

In [ ]:
# d
df['age'].value_counts()

In [6]:
# If you want Canvas visualization to show up on this notebook, 
# rather than popping up a new window, add this line:
# graphlab.canvas.set_target('ipynb')

In [7]:
for x in df.groupby('age'):
    print(x)

(22,   First Name Last Name        Country  age
2    Malcolm      Jone        England   22
5        Tod  Campbell  United States   22)
(23,   First Name Last Name Country  age
1      Alice  Williams  Canada   23
3      Felix     Brown     USA   23
4       Alex    Cooper  Poland   23)
(24,   First Name Last Name        Country  age
0        Bob     Smith  United States   24)
(25,   First Name Last Name      Country  age
6      Derek      Ward  Switzerland   25)

23    3
22    2
25    1
24    1
Name: age, dtype: int64

In [9]:
df['Country']

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [10]:
df['age']

0    24
1    23
2    22
3    23
4    23
5    22
6    25
Name: age, dtype: int64

Some simple columnar operations

In [11]:
df['age'].mean()

23.142857142857142

In [12]:
df['age'].max()

25

#Create new columns

In [13]:
df['Full Name'] = df['First Name'] + ' ' + df['Last Name']

In [14]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

In [15]:
df['age'] * df['age']

0    576
1    529
2    484
3    529
4    529
5    484
6    625
Name: age, dtype: int64

In [16]:
df['Country']

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [17]:
def transform_country(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [18]:
transform_country('Brazil')

'Brazil'

In [19]:
transform_country('Brasil')

'Brasil'

In [20]:
transform_country('USA')

'United States'

In [21]:
df['Country'].apply(transform_country)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [22]:
df['Country'] = df['Country'].apply(transform_country)

In [23]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward